mabl/ChibiOS/tools/embsysregviewdata/data/ARM_Cortex-M7/STMicroelectronics/STM32H7x3.xml
        <register>
          <name>SAI_BIM</name>
          <displayName>SAI_BIM</displayName>
          <description>Interrupt mask register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRUDRIE</name>
              <description>Overrun/underrun interrupt enable. This
              bit is set and cleared by software. When this bit is
              set, an interrupt is generated if the OVRUDR bit in
              the SAI_xSR register is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTEDETIE</name>
              <description>Mute detection interrupt enable. This
              bit is set and cleared by software. When this bit is
              set, an interrupt is generated if the MUTEDET bit in
              the SAI_xSR register is set. This bit has a meaning
              only if the audio block is configured in receiver
              mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCKCFGIE</name>
              <description>Wrong clock configuration interrupt
              enable. This bit is set and cleared by software. This
              bit is taken into account only if the audio block is
              configured as a master (MODE[1] = 0) and NODIV = 0.
              It generates an interrupt if the WCKCFG flag in the
              SAI_xSR register is set. Note: This bit is used only
              in TDM mode and is meaningless in other
              modes.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQIE</name>
              <description>FIFO request interrupt enable. This bit
              is set and cleared by software. When this bit is set,
              an interrupt is generated if the FREQ bit in the
              SAI_xSR register is set. Since the audio block
              defaults to operate as a transmitter after reset, the
              MODE bit must be configured before setting FREQIE to
              avoid a parasitic interruption in receiver
              mode,</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNRDYIE</name>
              <description>Codec not ready interrupt enable (AC97).
              This bit is set and cleared by software. When the
              interrupt is enabled, the audio block detects in the
              slot 0 (tag0) of the AC97 frame if the Codec
              connected to this line is ready or not. If it is not
              ready, the CNRDY flag in the SAI_xSR register is set
              and an interruption i generated. This bit has a
              meaning only if the AC97 mode is selected through
              PRTCFG[1:0] bits and the audio block is operates as a
              receiver.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFSDETIE</name>
              <description>Anticipated frame synchronization
              detection interrupt enable. This bit is set and
              cleared by software. When this bit is set, an
              interrupt will be generated if the AFSDET bit in the
              SAI_xSR register is set. This bit is meaningless in
              AC97, SPDIF mode or when the audio block operates as
              a master.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSDETIE</name>
              <description>Late frame synchronization detection
              interrupt enable. This bit is set and cleared by
              software. When this bit is set, an interrupt will be
              generated if the LFSDET bit is set in the SAI_xSR
              register. This bit is meaningless in AC97, SPDIF mode
              or when the audio block operates as a
              master.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BSR</name>
          <displayName>SAI_BSR</displayName>
          <description>Status register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OVRUDR</name>
              <description>Overrun / underrun. This bit is read
              only. The overrun and underrun conditions can occur
              only when the audio block is configured as a receiver
              and a transmitter, respectively. It can generate an
              interrupt if OVRUDRIE bit is set in SAI_xIM register.
              This flag is cleared when the software sets COVRUDR
              bit in SAI_xCLRFR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTEDET</name>
              <description>Mute detection. This bit is read only.
              This flag is set if consecutive 0 values are received
              in each slot of a given audio frame and for a
              consecutive number of audio frames (set in the
              MUTECNT bit in the SAI_xCR2 register). It can
              generate an interrupt if MUTEDETIE bit is set in
              SAI_xIM register. This flag is cleared when the
              software sets bit CMUTEDET in the SAI_xCLRFR
              register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCKCFG</name>
              <description>Wrong clock configuration flag. This bit
              is read only. This bit is used only when the audio
              block operates in master mode (MODE[1] = 0) and NODIV
              = 0. It can generate an interrupt if WCKCFGIE bit is
              set in SAI_xIM register. This flag is cleared when
              the software sets CWCKCFG bit in SAI_xCLRFR
              register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQ</name>
              <description>FIFO request. This bit is read only. The
              request depends on the audio block configuration: If
              the block is configured in transmission mode, the
              FIFO request is related to a write request operation
              in the SAI_xDR. If the block configured in reception,
              the FIFO request related to a read request operation
              from the SAI_xDR. This flag can generate an interrupt
              if FREQIE bit is set in SAI_xIM
              register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNRDY</name>
              <description>Codec not ready. This bit is read only.
              This bit is used only when the AC97 audio protocol is
              selected in the SAI_xCR1 register and configured in
              receiver mode. It can generate an interrupt if
              CNRDYIE bit is set in SAI_xIM register. This flag is
              cleared when the software sets CCNRDY bit in
              SAI_xCLRFR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFSDET</name>
              <description>Anticipated frame synchronization
              detection. This bit is read only. This flag can be
              set only if the audio block is configured in slave
              mode. It is not used in AC97or SPDIF mode. It can
              generate an interrupt if AFSDETIE bit is set in
              SAI_xIM register. This flag is cleared when the
              software sets CAFSDET bit in SAI_xCLRFR
              register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSDET</name>
              <description>Late frame synchronization detection.
              This bit is read only. This flag can be set only if
              the audio block is configured in slave mode. It is
              not used in AC97 or SPDIF mode. It can generate an
              interrupt if LFSDETIE bit is set in the SAI_xIM
              register. This flag is cleared when the software sets
              bit CLFSDET in SAI_xCLRFR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLVL</name>
              <description>FIFO level threshold. This bit is read
              only. The FIFO level threshold flag is managed only
              by hardware and its setting depends on SAI block
              configuration (transmitter or receiver mode). If the
              SAI block is configured as transmitter: If SAI block
              is configured as receiver:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BCLRFR</name>
          <displayName>SAI_BCLRFR</displayName>
          <description>Clear flag register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVRUDR</name>
              <description>Clear overrun / underrun. This bit is
              write only. Programming this bit to 1 clears the
              OVRUDR flag in the SAI_xSR register. Reading this bit
              always returns the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMUTEDET</name>
              <description>Mute detection flag. This bit is write
              only. Programming this bit to 1 clears the MUTEDET
              flag in the SAI_xSR register. Reading this bit always
              returns the value 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWCKCFG</name>
              <description>Clear wrong clock configuration flag.
              This bit is write only. Programming this bit to 1
              clears the WCKCFG flag in the SAI_xSR register. This
              bit is used only when the audio block is set as
              master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1
              register. Reading this bit always returns the value
              0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCNRDY</name>
              <description>Clear Codec not ready flag. This bit is
              write only. Programming this bit to 1 clears the
              CNRDY flag in the SAI_xSR register. This bit is used
              only when the AC97 audio protocol is selected in the
              SAI_xCR1 register. Reading this bit always returns
              the value 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAFSDET</name>
              <description>Clear anticipated frame synchronization
              detection flag. This bit is write only. Programming
              this bit to 1 clears the AFSDET flag in the SAI_xSR
              register. It is not used in AC97or SPDIF mode.
              Reading this bit always returns the value
              0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLFSDET</name>
              <description>Clear late frame synchronization
              detection flag. This bit is write only. Programming
              this bit to 1 clears the LFSDET flag in the SAI_xSR
              register. This bit is not used in AC97or SPDIF mode
              Reading this bit always returns the value
              0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BDR</name>
          <displayName>SAI_BDR</displayName>
          <description>Data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data A write to this register loads the
              FIFO provided the FIFO is not full. A read from this
              register empties the FIFO if the FIFO is not
              empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_PDMCR</name>
          <displayName>SAI_PDMCR</displayName>
          <description>PDM control register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDMEN</name>
              <description>PDM enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MICNBR</name>
              <description>Number of microphones</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKEN1</name>
              <description>Clock enable of bitstream clock number
              1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN2</name>
              <description>Clock enable of bitstream clock number
              2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN3</name>
              <description>Clock enable of bitstream clock number
              3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN4</name>
              <description>Clock enable of bitstream clock number
              4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_PDMDLY</name>
          <displayName>SAI_PDMDLY</displayName>
          <description>PDM delay register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DLYM1L</name>
              <description>Delay line adjust for first microphone
              of pair 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM1R</name>
              <description>Delay line adjust for second microphone
              of pair 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM2L</name>
              <description>Delay line for first microphone of pair
              2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM2R</name>
              <description>Delay line for second microphone of pair
              2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM3L</name>
              <description>Delay line for first microphone of pair
              3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM3R</name>
              <description>Delay line for second microphone of pair
              3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM4L</name>
              <description>Delay line for first microphone of pair
              4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM4R</name>
              <description>Delay line for second microphone of pair
              4</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
