mabl/ChibiOS/tools/embsysregviewdata/data/ARM_Cortex-M7/STMicroelectronics/STM32H7x3.xml
        <register>
          <name>AXI_INI3_FN_MOD_AHB</name>
          <displayName>AXI_INI3_FN_MOD_AHB</displayName>
          <description>AXI interconnect - INI x AHB functionality
          modification register</description>
          <addressOffset>0x44028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>Converts all AHB-Lite write transactions
              to a series of single beat AXI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>Converts all AHB-Lite read transactions
              to a series of single beat AXI</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_READ_QOS</name>
          <displayName>AXI_INI1_READ_QOS</displayName>
          <description>AXI interconnect - INI x read QoS
          register</description>
          <addressOffset>0x42100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI2_READ_QOS</name>
          <displayName>AXI_INI2_READ_QOS</displayName>
          <description>AXI interconnect - INI x read QoS
          register</description>
          <addressOffset>0x43100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_READ_QOS</name>
          <displayName>AXI_INI3_READ_QOS</displayName>
          <description>AXI interconnect - INI x read QoS
          register</description>
          <addressOffset>0x44100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI4_READ_QOS</name>
          <displayName>AXI_INI4_READ_QOS</displayName>
          <description>AXI interconnect - INI x read QoS
          register</description>
          <addressOffset>0x45100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI5_READ_QOS</name>
          <displayName>AXI_INI5_READ_QOS</displayName>
          <description>AXI interconnect - INI x read QoS
          register</description>
          <addressOffset>0x46100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI6_READ_QOS</name>
          <displayName>AXI_INI6_READ_QOS</displayName>
          <description>AXI interconnect - INI x read QoS
          register</description>
          <addressOffset>0x47100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>Read channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_WRITE_QOS</name>
          <displayName>AXI_INI1_WRITE_QOS</displayName>
          <description>AXI interconnect - INI x write QoS
          register</description>
          <addressOffset>0x42104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI2_WRITE_QOS</name>
          <displayName>AXI_INI2_WRITE_QOS</displayName>
          <description>AXI interconnect - INI x write QoS
          register</description>
          <addressOffset>0x43104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_WRITE_QOS</name>
          <displayName>AXI_INI3_WRITE_QOS</displayName>
          <description>AXI interconnect - INI x write QoS
          register</description>
          <addressOffset>0x44104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI4_WRITE_QOS</name>
          <displayName>AXI_INI4_WRITE_QOS</displayName>
          <description>AXI interconnect - INI x write QoS
          register</description>
          <addressOffset>0x45104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI5_WRITE_QOS</name>
          <displayName>AXI_INI5_WRITE_QOS</displayName>
          <description>AXI interconnect - INI x write QoS
          register</description>
          <addressOffset>0x46104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI6_WRITE_QOS</name>
          <displayName>AXI_INI6_WRITE_QOS</displayName>
          <description>AXI interconnect - INI x write QoS
          register</description>
          <addressOffset>0x47104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>Write channel QoS setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI1_FN_MOD</name>
          <displayName>AXI_INI1_FN_MOD</displayName>
          <description>AXI interconnect - INI x issuing
          functionality modification register</description>
          <addressOffset>0x42108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override ASIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override ASIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI2_FN_MOD</name>
          <displayName>AXI_INI2_FN_MOD</displayName>
          <description>AXI interconnect - INI x issuing
          functionality modification register</description>
          <addressOffset>0x43108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override ASIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override ASIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI3_FN_MOD</name>
          <displayName>AXI_INI3_FN_MOD</displayName>
          <description>AXI interconnect - INI x issuing
          functionality modification register</description>
          <addressOffset>0x44108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override ASIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override ASIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI4_FN_MOD</name>
          <displayName>AXI_INI4_FN_MOD</displayName>
          <description>AXI interconnect - INI x issuing
          functionality modification register</description>
          <addressOffset>0x45108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override ASIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override ASIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI5_FN_MOD</name>
          <displayName>AXI_INI5_FN_MOD</displayName>
          <description>AXI interconnect - INI x issuing
          functionality modification register</description>
          <addressOffset>0x46108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override ASIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override ASIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_INI6_FN_MOD</name>
          <displayName>AXI_INI6_FN_MOD</displayName>
          <description>AXI interconnect - INI x issuing
          functionality modification register</description>
          <addressOffset>0x47108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>Override ASIB read issuing
              capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>Override ASIB write issuing
              capability</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
