mabl/ChibiOS/tools/embsysregviewdata/data/ARM_Cortex-M7/STMicroelectronics/STM32H7x3.xml
        <register>
          <name>MDIOS_DOUTR20</name>
          <displayName>MDIOS_DOUTR20</displayName>
          <description>MDIOS output data register 20</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT20</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR21</name>
          <displayName>MDIOS_DOUTR21</displayName>
          <description>MDIOS output data register 21</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT21</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR22</name>
          <displayName>MDIOS_DOUTR22</displayName>
          <description>MDIOS output data register 22</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT22</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR23</name>
          <displayName>MDIOS_DOUTR23</displayName>
          <description>MDIOS output data register 23</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT23</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR24</name>
          <displayName>MDIOS_DOUTR24</displayName>
          <description>MDIOS output data register 24</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT24</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR25</name>
          <displayName>MDIOS_DOUTR25</displayName>
          <description>MDIOS output data register 25</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT25</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR26</name>
          <displayName>MDIOS_DOUTR26</displayName>
          <description>MDIOS output data register 26</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT26</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR27</name>
          <displayName>MDIOS_DOUTR27</displayName>
          <description>MDIOS output data register 27</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT27</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR28</name>
          <displayName>MDIOS_DOUTR28</displayName>
          <description>MDIOS output data register 28</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT28</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR29</name>
          <displayName>MDIOS_DOUTR29</displayName>
          <description>MDIOS output data register 29</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT29</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR30</name>
          <displayName>MDIOS_DOUTR30</displayName>
          <description>MDIOS output data register 30</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT30</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIOS_DOUTR31</name>
          <displayName>MDIOS_DOUTR31</displayName>
          <description>MDIOS output data register 31</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOUT31</name>
              <description>Output data sent to MDIO Master during
              read frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
